app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `issues`
JOIN `volumes` ON `volumes`.`id` = `issues`.`volume_id`
SELECT `issues`.*, `volumes`.`volume_no`, `volumes`.`year`
FROM `issues`
JOIN `volumes` ON `volumes`.`id` = `issues`.`volume_id`
ORDER BY `issues`.`created_at` DESC
 LIMIT 10, 10
---
    public function issues()
    {
        $this->checkLogin();

        $perPage = 10; // Number of issues per page

        $issues = $this->issueModel
            ->select('issues.*, volumes.volume_no, volumes.year')
            ->join('volumes', 'volumes.id = issues.volume_id')
            ->orderBy('issues.created_at', 'DESC')
            ->paginate($perPage, 'default');

SELECT *
FROM `articles`
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `articles`
---
    public function articles()
    {
        $this->checkLogin();

        $perPage = 10; // Number of articles per page

        $data = [
            'title' => 'Articles',
            'articles' => $this->articleModel->orderBy('created_at', 'DESC')->paginate($perPage),

SELECT `issues`.*, `volumes`.`volume_no`, `volumes`.`year`
FROM `issues`
JOIN `volumes` ON `volumes`.`id` = `issues`.`volume_id`
ORDER BY `volumes`.`year` DESC, `issues`.`issue_no` ASC
---
            return redirect()->to('/admin/articles')->with('success', 'Article added successfully.');
        }

        $issuesWithVolume = $this->issueModel
            ->select('issues.*, volumes.volume_no, volumes.year')
            ->join('volumes', 'volumes.id = issues.volume_id')
            ->orderBy('volumes.year', 'DESC')
            ->orderBy('issues.issue_no', 'ASC')
            ->findAll();

SELECT *
FROM `references`
ORDER BY `ref_no` ASC
 LIMIT 150, 10
SELECT COUNT(*) AS `numrows`
FROM `references`
---
    public function listReferences()
    {
        $this->checkLogin();

        // Use pagination and assign pager
        $references = $this->referenceModel
            ->orderBy('ref_no', 'ASC')
            ->paginate(10); // Display 10 references per page

SELECT *
FROM `references`
WHERE `references`.`id` = '1'
SELECT *
FROM `articles`
ORDER BY `title`
---
    public function editReference($id)
    {
        $this->checkLogin();

        // Fetch the reference
        $reference = $this->referenceModel->find($id);
        if (!$reference) {
            return redirect()->to('/admin/references')->with('error', 'Reference not found.');
        }

        // Fetch all articles for the dropdown
        $articleModel = new \App\Models\ArticleModel();
        $articles = $articleModel->orderBy('title')->findAll();

UPDATE `references` SET `ref_no` = '1', `authors` = 'Grundy IM, Campbell BM', `title` = 'Potential production and utilisation of oil from Trichilia spp. (Meliaceae)', `source` = 'Econ Bot', `publisher` = 'Struik Nature', `publisher_loc` = 'Pretoria, South Africa', `year` = '1993', `volume` = '47', `issue` = '1', `pages` = '148–153', `doi` = 'https://doi.org/10.1007/BF02862017', `type` = 'book', `article_id` = ''
WHERE `references`.`id` IN ('1')
---
            }

            // Update reference
            $this->referenceModel->update($id, [
                'ref_no' => $this->request->getPost('ref_no'),
                'authors' => $this->request->getPost('authors'),
                'title' => $this->request->getPost('title'),
                'source' => $this->request->getPost('source'),
                'publisher' => $this->request->getPost('publisher'),
                'publisher_loc' => $this->request->getPost('publisher_loc'),
                'year' => $this->request->getPost('year'),
                'volume' => $this->request->getPost('volume'),
                'issue' => $this->request->getPost('issue'),
                'pages' => $this->request->getPost('pages'),
                'doi' => $this->request->getPost('doi'),
                'type' => $this->request->getPost('type'),
                'article_id' => $this->request->getPost('article_id') // optional
            ]);

SELECT *
FROM `references`
WHERE `references`.`id` = '87'
DELETE FROM `references`
WHERE `id` IN ('87')
---
    public function deleteReference($id)
    {
        $this->checkLogin();

        $reference = $this->referenceModel->find($id);
        if (!$reference) {
            return redirect()->back()->with('error', 'Reference not found.');
        }

        $this->referenceModel->delete($id);